---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongHost
source: html/0b51abd6-4bcf-7f09-b480-4c82219e4357.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricAreaWrongHost Property

Fabric Area can be placed only in Structural Floors and straight Structural Walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricAreaWrongHost { get; }
```